{
  "navbar": {
    "accueil": "Accueil",
    "parcours": "Mon Parcours",
    "projets": "Mes Projets",
    "blog": "Mon blog"
  },

  "footer": {
    "contact": "Contactez-moi !"
  },

  "technos": {
    "titre": "Je connais ces technos :",
    "front": "En Front",
    "back": "En Back",
    "bdd": "Pour les bases de données",
    "outils": "Je connais ces outils",
    "env": "J'utilise ces environnements",

    "langues": "Je parle des langues aussi",
    "fr": "Français (natif)",
    "en": "Anglais"
  },

  "accueil": {
    "bonjour": "Bonjour",
    "moi": "Moi c'est",
    "metier": "développeur web full-stack",
    "photo": "c'est moi là",

    "quete1": "Actuellement en alternance avec Inovaxo et la Wild Code School",

    "la": "Là",
    "cv": "c'est mon CV"
  },

  "parcours": {
    "titre": "Mon parcours",
    "haut": "(le dernier en haut)",

    "AlternanceTitre": "Alternance",
    "AlternanceDate": "octobre 2023 - novembre 2024",
    "AlternanceDesc1": "Suite à ma formation à la Wild Code School et à mon stage, j’ai décidé de continuer ma formation en alternance. Toujours à la Wild Code School pour l’école et dans l’entreprise Inovaxo pour l’entreprise.",
    "AlternanceDesc2": "Le rythme était de 3 semaines en entreprise pour 1 semaine de cours.",
    "AlternanceDesc3": "L’école : Nous avons commencé par un projet afin d’apprendre à se servir des nouveaux outils dont nous aurons besoin par la suite ainsi qu’un rappel de ce qui avait été fait durant la première formation. Durant un deuxième temps, nous avons été en groupe de 4 sur un projet qui a duré jusqu’à la fin de la formation.",
    "AlternanceDesc4": "L’entreprise : Je n’ai pas trouvé d’alternance en javascript, pour correspondre à la formation. J’ai principalement travaillé sur des projets déjà présents en Java ou PHP. J’y ai développé de nouvelles fonctionnalités et corrigé des bugs.",

    "AubayTitre": "Stage chez Aubay",
    "AubayDate": "février 2023 - août 2023",
    "AubayDesc1": "En complément de ma formation, j'ai pu effectuer un stage de 6 mois dans l'entreprise Aubay, au cours duquel j'ai contribué à créer le site vitrine des stages. Le but est de pouvoir présenter les projets des stagiaires aux clients ainsi qu'aux futurs stagiaires.",
    "AubayDesc2": "J'ai pu me rendre compte du fonctionnement d'une entreprise, ses méthodes et ses contraintes. J'ai travaillé avec 2 autres stagiaires full-stack et une stagiaire designeuse. Il y avait aussi un PO et un lead développeur quand nous en avions besoin.",
    "AubayDesc3": "La stack technique était différente de celle apprise pendant la formation. Il a donc fallu commencer par des formations sur Angular, TypeScript mais surtout Java Springboot. Je n'ai pas eu de problème particulier avec Angular et TypeScript puisque je connaissais déjà React et JavaScript. Même s' il y a des différences notables, on s'y retrouve facilement. En ce qui concerne Java et Springboot en revanche, le démarrage a été plus compliqué mais j'ai réussi à m'y faire.",
    "AubayDesc4": "L'un des points importants que j'ai dû apprendre et réaliser pendant ce stage est les tests unitaires en front et en back. Pour ça aussi un temps d'adaptation a été nécessaire mais au final j'ai réussi.",

    "WCSTitre": "Ma formation à la Wild Code School",
    "WCSDate": "septembre 2022 - février 2023",
    "WCSDesc1": "La formation que j'ai suivie pour devenir développeur web full-stack s'est déroulée sur 5 mois à la Wild Code School de Nantes. Nous y avons appris à coder, tout d'abord avec les bases telles que html et css ainsi que javascript en dom. Puis on a continué avec React en front et enfin Express pour le back.",
    "WCSDesc2": "Cet apprentissage se fait avec des cours mais surtout des exercices et beaucoup de pratique au travers de 3 projets (que vous pouvez retrouver dans la partie 'mes projets'). Ces projets se font en groupes de 4 ou 5 et couvrent tout ce que l'on a vu, et plus encore car ils nous poussent à aller chercher par nous-mêmes ce dont on a besoin.",
    "WCSDesc3": "De plus, nous avons travaillé sur les bonnes pratiques de code ainsi que l'importance de la veille technologique.",
    "WCSDesc4": "Nous avons aussi appris les méthodes agiles avec notamment Jira.",

    "FacTitre": "La fac - EEEA",
    "FacDate": "septembre 2019 - juin 2022",
    "FacDesc1": "EEEA est l’acronyme de Électronique, énergie électrique, automatique. C’est grâce au module sur le Langage C de cette formation que j’ai trouvé ma voie. Cela m'a donné envie de continuer à coder et, par la suite, faire du développement web.",
    "FacDesc2": "J'ai le niveau licence, mais je n'ai pas la licence. Attention explication : j'ai validé la première et la troisième année ainsi que le second semestre de la seconde année. Donc il me manque la première moitié de la deuxième année.",
    "FacDesc3": "En bref, ça n'a rien à voir avec les compétences que j'ai en développement web. Je le mets ici juste pour dire que je n'ai pas rien fait pendant 3 ans.",

    "CertifTitre": "Mes certifications",

    "Certif1Titre": "TOEIC",
    "Certif1Date": "avril 2022",
    "Certif1Desc": "La fac m'a au moins permis de passer le TOEIC. J'ai eu 820 sur 990 points. Ce qui équivaut à un niveau B2.",
    "Certif1Doc": "Le document qui dit que c'est vrai",

    "Certif2Titre": "Certification développeur web et web mobile",
    "Certif2Date": "septembre 2023",
    "Certif2Desc": "J'ai passé une certification de développeur web et web mobile le 1er septembre. Elle équivaut à un niveau bac+2.",

    "technos": "Je remets ici les technos et outils que je connais, c'est pareil quand dans la partie accueil mais je les remets quand même"
  },

  "theme": {
    "titre": "Mes projets",
    "recents": "Les plus récents avant",
    "anciens": "Les plus anciens avant"
  },

  "blog": {
    "titre": "Mon blog",
    "ici": "ICI ",

    "doss_projet1": "c'est le",
    "doss_projet2": "dossier projet",
    "doss_projet3": "que j'ai fait pour le passage de la certification. Il a été réalisé sur la base du troisième projet fait durant ma formation à la Wild Code School.",

    "doss_pro1": "c'est le",
    "doss_pro2": "dossier professionnel",
    "doss_pro3": "que j'ai fait pour le passage de la certification. Il reprend les différents projets que j'ai pu faire jusque-là. Vous pouvez les retrouver dans la section",
    "doss_pro4": "Mes Projets",

    "pres1": "c'est la présentation qui va avec le dossier projet pour le passage de la certification."
  }
}
